ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
#include <xc.h>
#include <stdint.h>
#include <stdio.h>
#include "motor_paso.h"
#include "ws2812b.h"
#include "Libbuzzer.h"
#include "keypad4x4.h"
#include "I2C.h"
#include "LCD_I2C.h"
#include "DS1307.h"
#include "CNY70.h"
#include "irsensor.h"
#include "EPROM_DFM.h"
#include "funcionesGenerales.h"

/*==============================================================================
 * OBJETOS DE LOS PERIFÉRICOS
 *============================================================================*/

/* Motores paso a paso */
Stepper motor1;
Stepper motor2;
Stepper motor3;
Stepper motor4;

/* Tira de LEDs WS2812B */
LED_WS2812B tira1;

/* Buzzer */
Buzzer buzzer1;

/* Teclado matricial 4x4 */
Keypad teclado;
char tecla;

/* Sensores reflectivos CNY70 */
CNY70 sensor1;
CNY70 sensor2;
CNY70 sensor3;
CNY70 sensor4;

/* Valores obtenidos de los sensores CNY70 */
uint16_t valor_S1 = 0;
uint16_t valor_S2 = 0;
uint16_t valor_S3 = 0;
uint16_t valor_S4 = 0;

/* Sensor infrarrojo digital */
IRsensor sensor_ir;

/* Estructura para almacenar la fecha y hora del RTC */
DS1307_DateTime fechaHora;

/* Estado de las operaciones realizadas mediante I2C */
I2C_Status estado;

/* Variable para la lectura de la Memoria */
uint8_t dato_memoria;

/*==============================================================================
 * PROTOTIPOS DE FUNCIONES INTERNAS
 *============================================================================*/

static void config_motores(void);
static void config_leds(void);
static void config_buzzer(void);
static void config_keypad(void);
static void config_cny70(void);
static void config_ir(void);
static void config_i2c_lcd(void);
static void SubProceso_ModificarHorario();
static void SubProceso_AgregarHorario();
static void SubProceso_VerHorarios();
static void SubProceso_RegistrarPastillas();
static void SubProceso_DispensacionVerificacion();
static void SubProceso_ManejoErrores(char *mensaje,uint8_t nivel_error);
static void Dispensar(uint8_t pastillas_por_dispensar[6],uint8_t cantidad_horarios_para_dispersar);
static void Detallar_Horarios(uint8_t numero,uint16_t hora,uint16_t minuto,uint16_t tipo);
static void Detallar_CantPastillas(uint8_t  tecla);
static void Guardar_CantPastillas(uint8_t  pastillero_selecionado , uint8_t cantidad_a_sumar);
bool RecorrerEEPROM();

/*==============================================================================
 * CONFIGURACIÓN DE LOS MOTORES PASO A PASO
 *============================================================================*/

static void config_motores(void)
{
    /*
     * Motores conectados al puerto A:
     *
     * Motor 1: RA0 a RA3, nibble bajo.
     * Motor 2: RA4 a RA7, nibble alto.
     */
    Stepper_Init(&motor1, &LATA, &TRISA, &ANSELA, STEPPER_LOW_NIBBLE);
    Stepper_Init(&motor2, &LATA, &TRISA, &ANSELA, STEPPER_HIGH_NIBBLE);

    /*
     * Motores conectados al puerto B:
     *
     * Motor 3: RB0 a RB3, nibble bajo.
     * Motor 4: RB4 a RB7, nibble alto.
     */
    Stepper_Init(&motor3, &LATB, &TRISB, &ANSELB, STEPPER_LOW_NIBBLE);
    Stepper_Init(&motor4, &LATB, &TRISB, &ANSELB, STEPPER_HIGH_NIBBLE);
}

/*==============================================================================
 * CONFIGURACIÓN DE LA TIRA LED
 *============================================================================*/

static void config_leds(void)
{
    /*
     * Inicializa una tira WS2812B compuesta por dos LEDs.
     * El pin de comunicación se define en ws2812b.h.
     */
    WS2812B_Init(&tira1, 10);
}

/*==============================================================================
 * CONFIGURACIÓN DEL BUZZER
 *============================================================================*/

static void config_buzzer(void)
{
    /*
     * Buzzer conectado al pin RC1.
     *
     * 0x02 = 0b00000010.
     */
    Buzzer_Init(&buzzer1, &LATC, &TRISC, &ANSELC, 0x02);
    Buzzer_Off(&buzzer1);
}

/*==============================================================================
 * CONFIGURACIÓN DEL TECLADO MATRICIAL
 *============================================================================*/

static void config_keypad(void)
{
    /*
     * Teclado matricial 4x4 conectado al puerto D.
     *
     * RD0 a RD3: filas.
     * RD4 a RD7: columnas.
     */
    Keypad_Init(&teclado, &PORTD, &LATD, &TRISD, &ANSELD, &WPUD);
}

/*==============================================================================
 * CONFIGURACIÓN DE LOS SENSORES CNY70
 *============================================================================*/

static void config_cny70(void)
{
    /*
     * Configura el conversor ADC utilizando FOSC/64
     * como reloj de conversión.
     */
    CNY70_ADC_Init_FOSC64();

    /*
     * Sensor 1: RF5 / ANF0. /2D
     * Sensor 2: RF6 / ANF1. /2E
     * Sensor 3: RF2 / ANF2. /2A   
     * Sensor 4: RF3 / ANF3. /2B
     */
    CNY70_Init(&sensor1, &TRISF, &ANSELF, 0x01, 0x2D);
    CNY70_Init(&sensor2, &TRISF, &ANSELF, 0x02, 0x2E);
    
    CNY70_Init(&sensor3, &TRISF, &ANSELF, 0x04, 0x2A);
    CNY70_Init(&sensor4, &TRISF, &ANSELF, 0x08, 0x2B);
}

/*==============================================================================
 * CONFIGURACIÓN DEL SENSOR INFRARROJO
 *============================================================================*/

static void config_ir(void)
{
    /*
     * Sensor infrarrojo digital conectado al pin RF4.
     *
     * 0x10 = 0b00010000.
     */
    IRSensor_Init(&sensor_ir, &PORTF, &TRISF, &ANSELF, 0x10);
}

/*==============================================================================
 * CONFIGURACIÓN DEL BUS I2C Y DEL LCD
 *============================================================================*/

static void config_i2c_lcd(void)
{
    /*
     * Inicializa el módulo I2C1.
     *
     * El LCD y el RTC DS1307 comparten el mismo bus I2C.
     */
    I2C1_Init();

    /*
     * Establece la dirección del expansor PCF8574
     * utilizado por la pantalla LCD.
     */
    estado = LCD_I2C_SetAddress(PCF8574_7);

