ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    /*
     * Inicializa la pantalla LCD.
     */
    LCD_I2C_Init();

    /*
     * Limpia la pantalla después de su inicialización.
     */
    LCD_I2C_Clear();
}

/*==============================================================================
 * CONFIGURACIÓN GENERAL DE LOS PERIFÉRICOS
 *============================================================================*/

void config_perifericos(void)
{
    /*
     * Inicializa todos los periféricos utilizados
     * por el sistema.
     */
    
    //Boton de Congif
    TRISEbits.TRISE0=1;
    WPUEbits.WPUE0=1;
    ANSELEbits.ANSELE0=0;
    
    config_motores();
    config_leds();
    config_buzzer();
    config_keypad();
    config_cny70();
    config_ir();
    config_i2c_lcd();
    //Configuracion de memoria
    if(PORTEbits.RE0 == 0){ 
        LCD_I2C_SetCursor(2, 0);
        LCD_I2C_WriteString("BTN. Config - ON");
        __delay_ms(500);
        for (uint8_t x=0;x<39;x++)
        {
            EEPROM_WriteByte(x, 0);
        }
        EEPROM_WriteByte(1, 1);//Cant Horarios
        EEPROM_WriteByte(3, 4);//Cantidad de cOMPARTIMINETOS
        EEPROM_WriteByte(2, 4);//Cantidad total de pastillas
        EEPROM_WriteByte(5, 4);//Cantidad de pastillas en el cmpartimento1
        EEPROM_WriteByte(9, 13);//hora
        EEPROM_WriteByte(10, 47);//min
        EEPROM_WriteByte(13, 1);//PASTILLERO
        
        
    }else{
        LCD_I2C_SetCursor(2, 0);
        LCD_I2C_WriteString("BTN. Config - OFF");
        if(!RecorrerEEPROM())
            SubProceso_ManejoErrores("Mem. Desconfigurada",3);
        __delay_ms(500);
    }
        
    
}



/*
 * ============================================================================
 * FUNCIÓN: SubProceso_DispensacionVerificacion
 * ============================================================================
 * Verifica constantemente si la hora actual del sistema coincide con algún 
 * horario programado en la memoria para activar la dispensación de medicamentos.
 *
 * Flujo:
 * 1. Lee la fecha y hora actual del módulo RTC DS1307.
 * 2. Verifica la integridad y conexión del reloj en tiempo real.
 * 3. Recorre la cantidad de horarios actualmente activos en la EEPROM.
 * 4. Compara la hora y minuto actuales con los almacenados.
 * 5. Si hay coincidencia y no se ha dispensado, encola el pastillero.
 * 6. Si no hay coincidencia, resetea las banderas de dispensación.
 * 7. Ejecuta la función principal de dispensación si hay pastillas encoladas.
 * ============================================================================
 */
void SubProceso_DispensacionVerificacion(void)
{
    /*
     * Variables locales
     */
    uint8_t pastillas_por_dispensar[6];
    uint8_t cantidad_horarios_para_dispersar = 0;
    uint8_t cant_horarios = EEPROM_ReadByte(1);
    bool dispensar = false;

    /*----------------------------------------------------------------------
     * Lectura y validación del reloj (RTC)
     *----------------------------------------------------------------------*/
    
    estado = DS1307_ReadDateTime(&fechaHora);

    /* Validar pérdida de conexión o corrupción de datos en el reloj */
    if ((estado != I2C_OK) || (fechaHora.clock_running == 0) || (fechaHora.data_valid == 0))
    {
        SubProceso_ManejoErrores("RTC sin conexion", 1);
    }
       
    /*----------------------------------------------------------------------
     * Búsqueda de coincidencias de horarios programados
     *----------------------------------------------------------------------*/
    
    for (uint8_t x = 1; x <= cant_horarios; x++)
    {
        /* * EEPROM: 
         * 9 + ((x-1)*5) = Dirección de la hora 
         * 10 + ((x-1)*5) = Dirección de los minutos 
         */
        if (EEPROM_ReadByte(9 + ((x - 1) * 5)) == fechaHora.hours && EEPROM_ReadByte(10 + ((x - 1) * 5)) == fechaHora.minutes)
        {
            /* * Bandera de dispensación (11 + offset). 
             * Si es 0, significa que todavía no se ha dispensado en este minuto.
             */
            if (EEPROM_ReadByte(11 + ((x - 1) * 5)) == 0)
            {
                /* Guardar el número del pastillero a dispensar (13 + offset) */
                pastillas_por_dispensar[x - 1] = EEPROM_ReadByte(13 + ((x - 1) * 5));
                cantidad_horarios_para_dispersar++;
                dispensar = true;
            }
            
        }
        else
        {
            /* * Si la hora no coincide (ya pasó el minuto de activación), 
             * nos aseguramos de resetear las banderas de "ya dispensado" a 0
             * para todos los slots (11, 16, 21, 26, 31, 36) para que estén 
             * listos para el día siguiente.
             */
            EEPROM_UpdateByte(11, 0);
            EEPROM_UpdateByte(16, 0);
            EEPROM_UpdateByte(21, 0);
            EEPROM_UpdateByte(26, 0);
            EEPROM_UpdateByte(31, 0);
            EEPROM_UpdateByte(36, 0);
        }  
    }

    /*----------------------------------------------------------------------
     * Ejecución de la dispensación física
     *----------------------------------------------------------------------*/
    
    if (dispensar)
        Dispensar(pastillas_por_dispensar, cantidad_horarios_para_dispersar);
    
}
void Sensores(uint16_t lectura_sensores[4])
{
    lectura_sensores[0] = CNY70_Read(&sensor1);
    lectura_sensores[1] = CNY70_Read(&sensor2);
    lectura_sensores[2] = CNY70_Read(&sensor3);
    lectura_sensores[3] = CNY70_Read(&sensor4);
}
void Dispensar(uint8_t pastillas_por_dispensar[6],uint8_t cantidad_horarios_para_dispersar)
{
    bool error=false;
    bool dispensado;
    uint16_t lectura_sensor=0;
    
    /*
    uint8_t sensorir=1;
    
    for (uint8_t z=0; z<4;z++)
    {
        sensorir=IRSensor_ReadActiveLow(&sensor_ir);
        if (sensorir==1)
            break;
        __delay_ms(100);
    }
    //Sensor del vaso
    if(sensorir==1)
    {
        SubProceso_ManejoErrores("Colocar el Vaso",2);
        error=true;
    }
    */
    //Cantidad Necesaria
    for (uint8_t x=0; x<cantidad_horarios_para_dispersar;x++)
    {
        if(EEPROM_ReadByte(5+(pastillas_por_dispensar[x]))==0)
        {   
            char mensaje[20];

            sprintf(mensaje,"Pastillero %u Vacio", pastillas_por_dispensar[x]);
            SubProceso_ManejoErrores(mensaje,2);
            error=true;
        }
            
