ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    }
    if(!error)
    {
        LCD_I2C_Clear();
        LCD_I2C_SetCursor(2, 0);
        LCD_I2C_WriteString("! HORA DE LA DOSIS !");
        Buzzer_Off(&buzzer1);
        for (uint8_t x=0; x<cantidad_horarios_para_dispersar;x++)
        {
            dispensado = false;
            
            LCD_I2C_SetCursor(3, 0);
            LCD_I2C_WriteString("Entregando: Past. ");
            LCD_I2C_WriteUInt8(pastillas_por_dispensar[x+1],1);
            __delay_ms(2000);
            uint8_t intentos=4;
            lectura_sensor=0;
            while(1)
            {
                               
                for(uint16_t y=0; y<2048;y++)
                {
                    switch (pastillas_por_dispensar[x+1])
                    {

                        case 1:
                            lectura_sensor=CNY70_Read(&sensor1);
                            Stepper_Step_CW(&motor1);
                            break;
                        case 2:
                            lectura_sensor=CNY70_Read(&sensor2);
                            Stepper_Step_CW(&motor2);
                            break;
                        case 3:
                            lectura_sensor=CNY70_Read(&sensor3);
                            Stepper_Step_CW(&motor3);
                            break;
                        case 4:
                            lectura_sensor=CNY70_Read(&sensor4);
                            Stepper_Step_CW(&motor4);
                            break;
                        /* Se recibió un número */
                        default:
                            break;

                    }
                    if(lectura_sensor>1000)
                    {
                        Stepper_Off(&motor1);
                        Stepper_Off(&motor2);
                        Stepper_Off(&motor3);
                        Stepper_Off(&motor4);
                        dispensado = true;
                        break;
                    }
                    
                }
                if (dispensado)
                {
                    //Disminur cantida de pastillas
                    EEPROM_UpdateByte(4+(pastillas_por_dispensar[x]),EEPROM_ReadByte(4+(pastillas_por_dispensar[x]))-1);
                    EEPROM_UpdateByte(11+(x*5),1);
                    Buzzer_FinalCorrectClick(&buzzer1);
                    WS2812B_RGB(&tira1,0,200,0);
                    __delay_ms(500);
                    WS2812B_Clear(&tira1);
                    break;
                    
                }
                
                intentos--;
                Buzzer_WarningSound(&buzzer1);
                WS2812B_RGB(&tira1,240,200,0);
                __delay_ms(500);
                WS2812B_Clear(&tira1);
                if(intentos==0)
                {
                    SubProceso_ManejoErrores("No se pudo dispensar",3);
                    break;
                }
                
                
            }
            
            


        }
    }
    
}
/*
 * ============================================================================
 * FUNCIÓN: PantallaGeneral
 * ============================================================================
 * Muestra la pantalla principal de reposo del sistema. Actualiza constantemente 
 * la hora y espera la interacción del usuario para acceder al menú principal.
 *
 * Flujo:
 * 1. Inicia un bucle infinito de monitoreo.
 * 2. Verifica si existe alguna dispensación de medicamentos pendiente.
 * 3. Lee la fecha y hora actual del módulo RTC DS1307.
 * 4. Maneja posibles errores de conexión o pérdida de datos del RTC.
 * 5. Actualiza la pantalla LCD con el estado general y la hora actual.
 * 6. Monitorea el teclado de forma no bloqueante buscando la tecla '#'.
 * ============================================================================
 */
void PantallaGeneral(void)
{
    
        /*----------------------------------------------------------------------
         * Monitoreo de dispensación y lectura del RTC.
         *----------------------------------------------------------------------*/
        
        SubProceso_DispensacionVerificacion();
        LCD_I2C_SetCursor(2, 0);
        LCD_I2C_WriteString("Sistema en operacion");
        estado = DS1307_ReadDateTime(&fechaHora);

        /* Validación de estado de la comunicación y datos del RTC */
        if ((estado != I2C_OK) || (fechaHora.clock_running == 0) || (fechaHora.data_valid == 0))
        {
            SubProceso_ManejoErrores("RTC sin conexion", 1);
        }

        /*----------------------------------------------------------------------
         * Actualización de la interfaz LCD.
         *----------------------------------------------------------------------*/

        /*
                  12:30:45
            Sistema en operacion
            
            --- [#] VER MENU ---
        */

        LCD_I2C_SetCursor(2, 0);
        LCD_I2C_WriteString("Sistema en operacion");
        
        LCD_I2C_SetCursor(4, 0);
        LCD_I2C_WriteString("--- [#] VER MENU ---");
        
        LCD_I2C_SetCursor(3, 0);
        LCD_I2C_ClearFile(); /* Limpia la fila 3 para evitar residuos visuales */
        
        /* Impresión de la hora en formato HH:MM:SS centrada en la fila 1 */
        LCD_I2C_SetCursor(1, 6);
        LCD_I2C_WriteUInt8(fechaHora.hours, 2);
        LCD_I2C_WriteString(":"); 
        
        LCD_I2C_SetCursor(1, 9);
        LCD_I2C_WriteUInt8(fechaHora.minutes, 2);
        LCD_I2C_WriteString(":"); 
        
        LCD_I2C_SetCursor(1, 12);
        LCD_I2C_WriteUInt8(fechaHora.seconds, 2);
        
        /* Retardo para la tasa de refresco visual de la pantalla */
        __delay_ms(250);
        
        /*----------------------------------------------------------------------
         * Monitoreo del teclado.
         *----------------------------------------------------------------------*/
        
        while (1)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);

            switch (tecla)
            {
                /* Ingresar al menú de opciones */
                case '#':
                    
                    Buzzer_CorrectSound(&buzzer1);
                    SubProceso_MenuLCD();
                    return;

                /* Teclas ignoradas y estado inactivo (NO_KEY) */
                default:
                    
                    break;
            }
            
            /* * Se rompe el bucle de lectura inmediatamente para permitir 
             * que el bucle principal continúe y actualice el reloj cada 250ms.
             */
            break;
        }
           
