ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
}
/*==============================================================================
 * VERIFICACIÓN DE LAS CONDICIONES INICIALES
 *============================================================================*/
void SubProceso_CondicionesIniciales(void){
    
    //Bandera de Error=0
    
    /*
     * Verifica que la dirección del LCD se haya configurado
     * correctamente.
     */
    if (estado != I2C_OK)
        SubProceso_ManejoErrores("I2C sin conexion",1);
    
    //Lee la fecha y la hora almacenadas en el DS1307.
    estado = DS1307_ReadDateTime(&fechaHora);

    /*
     * Comprueba si el RTC respondió mediante el bus I2C.
     */
    if (estado != I2C_OK)
        SubProceso_ManejoErrores("RTC sin conexion",1);

    /*
     * clock_running igual a cero indica que el bit CH
     * está en uno y el oscilador se encuentra detenido.
     */
    if (fechaHora.clock_running == 0)
        SubProceso_ManejoErrores("RTC detenido",1);

    /*
     * data_valid igual a cero indica que la fecha o la hora
     * almacenada contiene valores fuera del rango permitido.
     */
    if (fechaHora.data_valid == 0)
        SubProceso_ManejoErrores("Mal Formato de Fecha",1);
    
    //EEPROM 
    //Recorrer todos los valores y verificar que no sea 0xFF
    if (RecorrerEEPROM()==false)
        SubProceso_ManejoErrores("EPROM no Configurada",1);
    
    if(EEPROM_ReadByte(1)==0)
        SubProceso_ManejoErrores("No hay Horarios",2);
    
    if(EEPROM_ReadByte(2)==0)
        SubProceso_ManejoErrores("No hay Pastillas",2);
    
    LCD_I2C_Clear();
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Sistema correcto");

    //Enciende la tira LED en color verde.
    WS2812B_RGB(&tira1, 0, 200, 0);
    __delay_ms(2000);
    WS2812B_Clear(&tira1);
    
    

}
//dEVUELVE TRUE CUNADO EL RECORRIDO SALIO SIN NING[UN 0XFF]
bool RecorrerEEPROM()
{
    for(uint8_t x=0;x<39;x++)
    {
        if (EEPROM_ReadByte(x)== 0xFF)
            return  false;
    }
    return true;
}

/*==============================================================================
 * SISTEMA DE ERROR
 *============================================================================*/

void SubProceso_ManejoErrores(char *mensaje,uint8_t nivel_error){
    /*
     * Limpia la pantalla y muestra el mensaje de error.
     */
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Alerta en el Sistema");

    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_WriteString(mensaje);
    
    //Critico - 1 
    //Alerta - 2
    switch (nivel_error)
        {
            case 1: 
                //Enciende la tira LED en color rojo.
                WS2812B_RGB(&tira1, 200, 0, 0);
                Buzzer_ErrorSound(&buzzer1);
                break;

            case 2:
                //Enciende la tira LED en color amarillo.
                WS2812B_RGB(&tira1, 250, 200, 0);
                Buzzer_WarningSound(&buzzer1);
                __delay_ms(2000);
                WS2812B_Clear(&tira1);
                return;
            case 3:
                //Enciende la tira LED en color amarillo.
                WS2812B_RGB(&tira1, 250, 200, 0);
                Buzzer_WarningSound(&buzzer1);
                LCD_I2C_SetCursor(4, 0);
                LCD_I2C_WriteString("Llamar Mantenimiento");
                while(1)
                {
                   __delay_ms(1000);
                }
                
                return;

            default:
                break;
               
        }
    __delay_ms(3000);
    
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Reiniciar Sistema");
    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_WriteString("[#]Resetear Sistema");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            
            case '#':
                Buzzer_ButtonClick(&buzzer1);
                asm("RESET");
                break;
            /* Se recibió un número */
            default:
                
                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;

        }

        /* Salir únicamente cuando la selección sea válida */
        if (tecla != KEYPAD_NO_KEY)
            break;
    }
}
/******************************************************************************
 * Función: MostrarAnimacionCarga
 * ---------------------------------------------------------------------------
 * Muestra una animación de progreso utilizando 4 bloques sólidos.
 *
 * Parámetros:
 *      fila    -> Fila donde inicia la animación.
 *      columna -> Columna donde inicia la animación.
 ******************************************************************************/
void MostrarAnimacionCarga(unsigned char fila, unsigned char columna)
{
    LCD_I2C_CreateSolidPixel(0);
    LCD_I2C_SetCursor(fila, columna);

    for (unsigned char index = 0u; index < 4u; index++)
    {
        LCD_I2C_WriteChar((char)0u);
        __delay_ms(300);
    }
}


/******************************************************************************
 * Función: SubProceso_MenuLCD
 *----------------------------------------------------------------------------
 * Muestra el menú principal del sistema y espera a que el usuario seleccione
 * una opción mediante el teclado matricial.
 *
 * Opciones disponibles:
 *   1 -> Agregar horario
 *   2 -> Modificar horario
 *   3 -> Ver horarios
 *   4 -> Registrar pastillas
 *   * -> Resetear sistema
 *
 * Si se ingresa una opción inválida, el menú vuelve a mostrarse.
 ******************************************************************************/
void SubProceso_MenuLCD(void)
{
    /* Inicializar la tecla como "sin pulsar" */
    tecla = KEYPAD_NO_KEY;

    /* Mantener el menú activo hasta recibir una opción válida */
    while (tecla == KEYPAD_NO_KEY)
    {
        /*==============================================================
         * Pantalla de bienvenida
         *==============================================================*/
        LCD_I2C_Clear();

